test/app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
---
  def edit
    @task = Task.find(params[:id])